---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyInteger
source: html/58007cd2-6acc-6e2d-1c57-1003a70c24eb.htm
---
# AssetPropertyInteger Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.